package common.constant;

/**
 * =====================================================================================================================
 * 【ポイントタウン】:定数
 * =====================================================================================================================
 *
 * @author kimC
 *
 */
public class PointtownConstants {

	/**
	 * privateコンストラクタでインスタンス生成を抑止
	 */
	private PointtownConstants() {
	}

	// ==================================================================================================================
	// URL
	// ==================================================================================================================
	/** 【PC】:ログインURL */
	public static final String PC_LOGIN_URL = "https://www.pointtown.com/ptu/show_login.do";
	/** 【PC】:ゲームコンテンツURL */
	public static final String PC_CM_URL = "http://www.pointtown.com/ptu/movie_site/index.do";
	// ==================================================================================================================
	// アカウント情報
	// ==================================================================================================================
	/** 【PC】:ログインメールアドレス */
	public static final String PC_LOGIN_MAIL = "kimyea.006@gmail.com";
	/** 【PC】:ログインパスワード */
	public static final String PC_LOGIN_PASSWORD = "20110119Jjz";
}
